:PROPERTIES:
:ID:       9c9068cc-7e0e-4744-a013-07897991f24a
:END:
#+title: cpp-notes
#+SETUPFILE: ../themes/org/theme-readtheorg.setup
#+EXPORT_FILE_NAME: index.html

** Standard Integers
Since the size of ~int~ is different on different compilers on different platforms, standard int was declared in the ~cstdint~ library.
#+begin_src C++
#include <cstdint>

int main() {
  std::int8_t one; // 1 byte integer
  std::uint8_t two; // 1 byte unsigned integer
  std::int16_t three; // 2 byte integer
  std::uint16_t four; // 2 byte unsigned integer
  std::int32_t five; // 4 byte integer
  std::uint32_t six; // 4 byte unsigned integer
  std::int64_t seven; // 8 byte integer
  std::uint64_t eight; // 8 byte unsigned integer
  return 0;
}
#+end_src

#+RESULTS:

The above may be slower on some hardware. For example, 32 bit integers may be slower than 64 bit integers on a 64bit CPU so the following types were created:
#+begin_src C++
#include <cstdint>

int main() {
  std::int_fast32_t a; // will give the fastest integer having atleast 32 bits
  std::int_least32_t b; // will give the smallest integer having atleast 32 bits
  return 0;
}
#+end_src

#+RESULTS:
#+begin_quote

Note that in many compilers, ~int_fast8_t~ and ~int_least8_t~ behave like ~char~ instead of integer values so prefer using the 16bit versions. So, if you try to print a variable of type ~int_fast8_t~ with the value 65 (for example), it will print A instead!!
#+end_quote
** Rounding Errors in Decimals
- In binary, a simple decimal number like 0.1 is represented in an infinite sequence 0.00011001100... causing it to be less precise.
  #+begin_src C++ :flags -std=c++17
  #include <iostream>
  #include <iomanip>

  int main() {
    double a{0.1};
    std::cout << std::setprecision(20);
    std::cout << a << std::endl;

    double b{};
    b = 0.1 + 0.1 + 0.1 + 0.1 + 0.1 + 0.1 + 0.1 + 0.1 + 0.1 + 0.1; // should be equal to 1.0
    std::cout << b << std::endl;

    if (a == b) std::cout << "YES";
    else std::cout << "NO";
    return 0;
  }
  #+end_src 

  #+RESULTS:
  |                0.1 |
  | 0.9999999999999999 |
  |                 NO |
** NaN and Infinity
#+begin_src C++ :flags -std=c++17
#include <iostream>

int main() {
  double zero {0.0};
  std::cout << 5.0/zero << std::endl; // outputs inf
  std::cout << zero/zero << std::endl; // outputs nan
  return 0;
}
#+end_src

#+RESULTS:
|  inf |
| -nan |
** Boolean Values
- No need to import ~stdbool~ like in C to use ~true~ and ~false~.
- Sending ~true~ and ~false~ values to stdout prints 0 and 1 instead.
- To print true and false instead, do this-
  #+begin_src C++
  #include <iostream>

  int main() {
    bool a {false};
    bool b {!a};
    std::cout << a << " " << b << std::endl;
    std::cout << std::boolalpha; // causes bools to print as "true" or "false"
    std::cout << a << " " << b << std::endl;
    return 0;
  }
  #+end_src

  #+RESULTS:
  |     0 |    1 |
  | false | true |
** Explicit Type Conversions
- Unlike C, where we convert types using ~(<type>) variable~ to cast to different types, in C++, we use ~static_cast~ operator.
  #+begin_src C++
  #include <iostream>

  void print(double x) {
    std::cout << x << std::endl;
  }

  int main() {
    int a{5};
    print(static_cast<double>(a));
    return 0;
  }
  #+end_src

  #+RESULTS:
  : 5

  #+begin_quote
  
The ~static_cast~ operator will produce undefined behavior if the value being converted doesn’t fit in range of the new type.
  #+end_quote
** Hexadecimal, Octal and Binary Literals
You may use these decimals by prefixing the following-
- ~0x~ for hexadecimal, eg- ~int a{0x1F}~
- ~0~ for octal, eg- ~int a{012}~
- ~0b~ for binary, eg- ~int a{0b1100011}~ (c++14 onwards)
By default, ~std::cout~ outputs values in decimals.
You can specify the output type using-
#+begin_src C++
#include <iostream>
#include <bitset> // for std::bitset

int main() {
  int x{69420};
  // Decimal
  std::cout << x << std::endl;

  // Octal
  std::cout << std::oct;
  std::cout << x << std::endl;

  // Hexadecimal
  std::cout << std::hex;
  std::cout << x << std::endl;

  // Binary
  std::cout << std::bitset<16>{0b10110} << std::endl;
  return 0;
}
#+end_src

#+RESULTS:
|  69420 |
| 207454 |
|  10f2c |
|  10110 |

In C++20 and C++23, better options are available-
#+begin_src C++ :flags -std=c++2a
#include <iostream>
#include <format> // C++20
// #include <print> // C++23

int main() {
  std::cout << std::format("{:b}\n", 0b1100101);
  std::cout << std::format("{:#b}\n", 0b1100101);
  // std::print("{:#b}\n", 0b1100101); C++23
  return 0;
}
#+end_src

#+RESULTS:
** ~constexpr~ and ~consteval~
- As stated above, ~constexpr~ is used to tell the compiler that a variable is a compile-time constant.
- ~constexpr~ can be used with functions to tell the compiler that the function is a compile-time function.
  #+begin_src C++
constexpr int greater(int x, int y) {
  return (x > y ? x : y);
}
  #+end_src 
- If the parameters passed to a ~constexpr~ function are not compile-time constants, the function will be evaluated at run-time.
- If the return value is not being used in a context where a compile-time constant is required, the function may or may not be evaluated at run-time.
#+begin_src C++ :flags -std=c++20 -Wall -Wextra -Wpedantic -Wconversion -Wsign-conversion
#include <iostream>
#include <type_traits> // for std::is_constant_evaluated

constexpr int greater(int x, int y) {
  return (x > y ? x : y);
}

int main() {
  constexpr int p {greater(5, 6)}; // always a compile time constant
  std::cout << p << std::endl;

  std::cout << greater(5, 6) << std::endl; // may be a compile time constant
  return 0;
}
#+end_src

#+RESULTS:
| 6 |
| 6 |
** Strings
- C like strings are avoided because they are hard to work with and can be unsafe.
#+begin_src C++
#include <iostream>
#include <string>

int main() {
  std::string name {"Prayag"};
  name = "Prayag Jain"; // can be reassigned
  std::cout << name << std::endl;
  return 0;
}
#+end_src

#+RESULTS:
: Prayag Jain
- You can use ~std::getline()~ to read strings in C++.
#+begin_src C++
#include <iostream>
#include <string>

int main() {
  std::string str;
  std::cout << "Enter name: ";

  // std::cin >> std::ws is an expression which ultimately returns std::cin
  std::getline(std::cin >> std::ws, str);

  std::cout << "Hi there, " << str << "!" << std::endl;
  return 0;
}
#+end_src
- ~std::ws~ is an input manipulator which allows getline to ignore any leading whitespace characters already present in the input buffer.
- ~std::ws~ is not preserved across calls so it must be used with every getline call.
- Use ~str.length()~ or ~std::ssize(str)~ (defined in ~<string>~) to get the length of a string named ~str~.
- Initializing using ~std::string~ is expensive, so do not pass them by value in functions.
- Normal string literals with double quotes around them are C-Style string literals, E.g. ~"hello"~.
- Using the suffix ~std::string_literals::s~ will form an ~std::string~ literal, E.g. ~"hello"std::string_literals::s~.
** ~std::string_view~
- Whenever an ~std:string~ is initialized, the string literal provided is copied into the string object (expensive operation).
- Even in functions, when an ~std::string~ is passed by value, it is copied into the function parameter (expensive operation).
- ~std::string_view~ is a lightweight alternative to ~std::string~.
- Always prefer ~std::string_view~ over ~std::string~ unless you need to modify the string.
- It lives under the ~<string_view>~ header.
- Assigning a new string to a ~std::string_view~ will not change the original string, it will just point to the new string.
- You can use the ~std::string_view_literals::sv~ suffix to form a ~std::string_view~ literal.
- Unlike ~std::string~, ~std::string_view~ can be used in ~constexpr~ contexts.
- The ~remove_prefix(count)~ and ~remove_suffix(count)~ member functions can be used to remove a prefix or suffix from a string view (does NOT modify the referenced string, just the view).
#+begin_src C++ :flags -std=c++20
#include <string_view>
#include <iostream>

int main() {
  std::string_view str {"Hello, World!"};
  std::cout << str << std::endl;;

  str.remove_prefix(2); // remove the first two characters
  str.remove_suffix(2); // remove the last two characters
  std::cout << str << std::endl;
  return 0;
}
#+end_src

#+RESULTS:
| Hello | World! |
| llo   | Worl   |
*** ~flip(position)~
Used to flip a bit (to 1 if it was 0 and to 0 if it was 1).

#+begin_src C++ :flags -std=c++20
#include <iostream>
#include <bitset>

int main() {
  std::bitset<5> bits{0b10101};
  std::cout << bits << '\n';

  bits.set(1);
  std::cout << bits << '\n';

  bits.flip(3);
  std::cout << bits << '\n';

  bits.reset(0);
  std::cout << bits << '\n';
  return 0;
}
#+end_src

#+RESULTS:
| 10101 |
| 10111 |
| 11111 |
| 11110 |
*** Testing Bits using Masks
#+begin_src C++
#include <iostream>
#include <cstdint>

int main() {
  // creating masks
  [[maybe_unused]] constexpr std::uint8_t mask1 {0b00000001};
  [[maybe_unused]] constexpr std::uint8_t mask2 {0b00000010};
  [[maybe_unused]] constexpr std::uint8_t mask3 {0b00000100};
  [[maybe_unused]] constexpr std::uint8_t mask4 {0b00001000};
  [[maybe_unused]] constexpr std::uint8_t mask5 {0b00010000};
  [[maybe_unused]] constexpr std::uint8_t mask6 {0b00100000};
  [[maybe_unused]] constexpr std::uint8_t mask7 {0b01000000};
  [[maybe_unused]] constexpr std::uint8_t mask8 {0b10000000};

  // testing if a bit at position 4 (starting from 0 from the right) is on or off using masks
  std::uint8_t flags {0b01111011}; // arbitrary value
  std::cout << "4th bit is " << (static_cast<bool>(flags & mask5) ? "on" : "off") << std::endl;
  return 0;
}
#+end_src

#+RESULTS:
: 4th bit is on
*** Setting and Resetting Bits using Masks
#+begin_src C++
#include <iostream>
#include <cstdint>

int main() {
  // creating masks
  [[maybe_unused]] constexpr std::uint8_t mask1 {0b00000001};
  [[maybe_unused]] constexpr std::uint8_t mask2 {0b00000010};
  [[maybe_unused]] constexpr std::uint8_t mask3 {0b00000100};
  [[maybe_unused]] constexpr std::uint8_t mask4 {0b00001000};
  [[maybe_unused]] constexpr std::uint8_t mask5 {0b00010000};
  [[maybe_unused]] constexpr std::uint8_t mask6 {0b00100000};
  [[maybe_unused]] constexpr std::uint8_t mask7 {0b01000000};
  [[maybe_unused]] constexpr std::uint8_t mask8 {0b10000000};

  std::uint8_t flags {0b01101101};

  // turning flag 4 on
  flags |= mask5; // using bitwise OR

  // turning flag 0 off
  flags &= ~mask1; // using bitwise AND and bitwise NOT

  // flipping bit 7
  flags ^= mask8; // using bitwise XOR

  // flipping bits 3 and 2 simultaneously
  flags ^= (mask4 | mask3);

  std::cout << "The 4th bit is " << (static_cast<bool>(flags & mask5) ? "on" : "off") << std::endl;
  std::cout << "The 0th bit is " << (static_cast<bool>(flags & mask1) ? "on" : "off") << std::endl;
  std::cout << "The 7th bit is " << (static_cast<bool>(flags & mask8) ? "on" : "off") << std::endl;
  std::cout << "The 3rd bit is " << (static_cast<bool>(flags & mask4) ? "on" : "off") << std::endl;
  std::cout << "The 2rd bit is " << (static_cast<bool>(flags & mask3) ? "on" : "off") << std::endl;
  return 0;
}
#+end_src

#+RESULTS:
| The | 4th | bit | is | on  |
| The | 0th | bit | is | off |
| The | 7th | bit | is | on  |
| The | 3rd | bit | is | off |
| The | 2rd | bit | is | off |

- You may use ~std::bitset~ instead of ~std::uint8_t~ too!
** Example Hex Colour to RGBA Colour
#+begin_src bash
printf "FF03CA04" > /tmp/inp
#+end_src

#+RESULTS:

#+begin_src C++ :cmdline < /tmp/inp :results value drawer
#include <iostream>
#include <bitset>
#include <cstdint>

int main() {
  // defining masks
  constexpr std::uint32_t redBits {0xFF000000};
  constexpr std::uint32_t blueBits {0x00FF0000};
  constexpr std::uint32_t greenBits {0x0000FF00};
  constexpr std::uint32_t alphaBits {0x000000FF};

  std::uint32_t hexVal {};
  std::cin >> std::hex >> hexVal; // std::hex allows us to read in hex (input modifier)

  // getting individual colours as integers
  int red {static_cast<int>((hexVal & redBits) >> 24)};
  int blue {static_cast<int>((hexVal & blueBits) >> 16)};
  int green {static_cast<int>((hexVal & greenBits) >> 8)};
  int alpha {static_cast<int>(hexVal & alphaBits)};

  std::cout << "rgba(" << red << "," << blue << "," << green << "," << alpha << ")" << std::endl;
  return 0;
}
#+end_src

#+RESULTS:
:results:
rgba(255,3,202,4)
:end:
* Namespaces 

- A namespace provides a scope region called the namespace scope which means that any thing defined in that scope won't be mistaken for anything else with the same name defined in some other namespace.
#+begin_src C++ :results value drawer
#include <iostream>
#include <string>

void print(std::string x, int y) {
  std::cout << x << y << std::endl;
}

namespace mynamespace {
  int a {5};
  void print(); // defining an arbitrary function in this namespace
  void doSomething(int b) {
    ::print("hello ", b); // use print from the global namespace instead of this namespace
  }
}

int main() {
  mynamespace::doSomething(mynamespace::a);
  using namespace mynamespace;
  doSomething(a);
  return 0;
}
#+end_src

#+RESULTS:
:results:
hello 5
hello 5
:end:
#+begin_quote

Multiple definitions of the same namespace is allowed in C++.
#+end_quote
- Nested namespaces can be accessed by doing something like ~namespaceOne::namespaceTwo::hello~.
** Namespace Aliases
#+begin_src C++
#include <iostream>

namespace Foo {
  namespace Goo {
    int a {5};
  }
}

int main() {
  namespace fg = Foo::Goo;
  std::cout << fg::a << std::endl;
  return 0;
}
#+end_src

#+RESULTS:
: 5

#+begin_quote

Avoid deeply nested namespaces!
#+end_quote
** ~constexpr~ if statements
- Consider the following code-
  #+begin_src C++
  #include <iostream>

  int main() {
    constexpr double pi {3.14};
    if (pi == 3.14) {
      std::cout << ("Hello World") << std::endl;
    } else {
      std::cout << ("Goodbye World") << std::endl; // This will never be printed
    }
    return 0;
  }
  #+end_src
- The condition above is /always/ true.
- This is wasteful at runtime so C++17 introduced constexpr if statements-
  #+begin_src C++
  #include <iostream>

  int main() {
    constexpr double pi {3.14};
    if constexpr (pi == 3.14)
      std::cout << "pi is 3.14" << std::endl;
    else
      std::cout << "pi is not 3.14" << std::endl;
    return 0;
  }
  #+end_src

  #+RESULTS:
  : pi is 3.14
** The ~[[fallthrough]]~ attribute
- When using switch statements, if we do not use the ~break~ or ~return~ keyword, the cases following the matched case will also be executed which is known as a fallthrough.
- This is not desired mostly but when it is, we can tell the compiler to avoid giving a warning by using the ~[[fallthrough]]~ attribute.
#+begin_src C++ :flags -Wall -Werror -pedantic-errors -Weffc++ -Wconversion -Wsign-conversion -std=c++17
#include <iostream>

int main() {
  switch (2) {
  case 1:
    std::cout << "1" << std::endl;
    break;
  case 2:
    std::cout << "2" << std::endl;
    [[fallthrough]];
  case 3:
    std::cout << "3" << std::endl;
    break;
  }
  return 0;
}
#+end_src

#+RESULTS:
| 2 |
| 3 |

#+begin_quote

Note that the semicolon used along with the ~[[fallthrough]]~ attribute is a ~null~ statement.
#+end_quote
** Built-in PRNGs in C++
- In the ~<random>~ library, there are 6 PRNGs available for use (as of C++20).
| Type name             | Family                                 |  Period | State size* | Performance | Quality | Should I use this?          |
|-----------------------+----------------------------------------+---------+-------------+-------------+---------+-----------------------------|
| ~minstd_rand~         | Linear congruential generator          |    2^31 | 4 bytes     | Bad         | Awful   | No                          |
| ~minstd_rand0~        | Linear congruential generator          |    2^31 | 4 bytes     | Bad         | Awful   | No                          |
| mt19937               | Mersenne twister                       | 2^19937 | 2500 bytes  | Decent      | Decent  | Probably (see next section) |
| ~mt19937_64~         | Mersenne twister                       | 2^19937 | 2500 bytes  | Decent      | Decent  | Probably (see next section) |
| ranlux24              | Subtract and carry                     |  10^171 | 96 bytes    | Awful       | Good    | No                          |
| ranlux48              | Subtract and carry                     |  10^171 | 96 bytes    | Awful       | Good    | No                          |
| knuth_b               | Shuffled linear congruential generator |    2^31 | 1028 bytes  | Awful       | Bad     | No                          |
| default_random_engine | Any of above (implementation defined)  |  Varies | Varies      | ?           | ?       | No2                         |
| rand()                | Linear congruential generator          |    2^31 | 4 bytes     | Bad         | Awful   | Nono                        |
- We should only use the Mersenne twister PRNG out of all the other built-in methods (if you don't have the choice to use third party libraries).
- ~mt19937~ generates 32 bit unsigned integers while ~mt19937_64~ generates 64 bit unsigned integers.
#+begin_src C++
#include <iostream>
#include <random>

int main() {
  std::mt19937 mt{}; // initializing
  std::cout << mt() << std::endl; // using mt() is the preferred way to call the mt.operator() method
  return 0;
}
#+end_src

#+RESULTS:
: 3499211612
- To generate numbers within a range with unbiased results (i.e. each number has an equal chance of being generated), we can use the ~std::uniform_int_distribution~ class.
#+begin_src C++
#include <iostream>
#include <random>

int main() {
  std::mt19937 mt{};

  std::uniform_int_distribution dice{1,6};

  // printing a bunch of random numbers
  for (int count {1}; count <= 40; count++) {
    std::cout << dice(mt) << ' ';
  }
  return 0;
}
#+end_src

#+RESULTS:
: 5 1 6 6 1 6 6 2 4 2 1 4 2 2 4 6 6 6 6 6 1 5 6 6 6 1 3 5 5 2 1 1 3 1 6 4 5 6 6 4
- We can use ~std::chrono~ to seed the PRNG with the current time (it stores the time in "ticks" which is usually in nanoseconds or microseconds!).
#+begin_src C++
#include <iostream>
#include <random>
#include <chrono>

int main() {
  std::mt19937 mt{static_cast<std::mt19937::result_type>(std::chrono::steady_clock::now().time_since_epoch().count())};

  std::uniform_int_distribution dice{1,6};

  for (int i {1}; i <= 40; i++) {
    std::cout << dice(mt) << ' ';
  }
}
#+end_src

#+RESULTS:
: 1 4 1 6 6 4 1 6 3 5 5 1 4 1 1 3 5 5 4 5 4 1 5 6 5 2 6 3 4 6 1 5 2 1 2 1 4 1 2 3
- You can also seed using the system's random device (recommended over system time)-
#+begin_src C++
#include <iostream>
#include <random>

int main() {
  std::mt19937 mt{std::random_device{}()};

  std::uniform_int_distribution dice{1,6};
  for (int i {0}; i < 40; i++)
    std::cout << dice(mt) << ' ';
  return 0;
}
#+end_src

#+RESULTS:
: 2 1 2 1 6 4 5 1 6 2 2 1 2 3 1 3 1 3 2 3 3 2 4 3 1 3 5 6 5 2 6 5 5 1 3 1 2 1 2 6

#+begin_quote

~std::random_device~ also generates random numbers but should not be used as a PRNG because it is implementation defined, may not be available on all platforms, and might produce low quality results on different compilers.
#+end_quote
- The internal state of Mersenne twister is 624 bytes in size.
- The seeds we provided above were only 4 bytes in size causing the PRNG to be heavily underseeded.
- ~std::seed_seq~ can be used to provide a seed sequence to the PRNG.
- We can provide as many random values to ~std::seed_seq~ as we want and it generate unbiased seed values with the required size for the PRNG.
#+begin_src C++
#include <iostream>
#include <random>

int main() {
  std::random_device rd{};
  std::seed_seq ss{rd(), rd(), rd(), rd(), rd(), rd(), rd(), rd()}; // 8 random integers
  std::mt19937 mt{ss}; // initializing using the seed sequence

  std::uniform_int_distribution dice{1,6};

  for(int i {0}; i < 40; i++)
    std::cout << dice(mt) << ' ';

  return 0;
}
#+end_src

#+RESULTS:
: 4 3 4 2 5 4 2 6 2 5 5 1 1 3 2 4 5 6 6 6 5 5 5 2 3 3 2 2 1 4 4 6 4 4 2 4 1 6 5 6
* Function Templates
- The generic type is specified using a template parameter.
#+begin_src C++
template <typename T>
T add(T a, T b) {
  return a + b;
}
#+end_src
- The ~typename~ or the ~class~ keyword is used to specify a template parameter (it doesn't matter if you use ~class~ or ~typename~, both mean the same).
- A function template is used to generate functions. Function templates themselves are not functions.
- We can call the add function doing something like this- ~add<int>(5, 6)~. The compiler will see that a function definition for ~add~ does not already exist, so it will generate one.
- When the data types of arguments matches the typename of the template, we can simply let the compiler deduce the typename doing something like this- ~add<>(5, 6)~ or simply ~add(5,6)~.
#+begin_src C++
#include <iostream>
template <typename T>
T getMax(T a, T b) {
  return (a > b) ? a : b;
}

char getMax(char a, char b) {
  return (a > b) ? a : b;
}

int main() {
  std::cout << getMax<int>(5, 10) << std::endl; // calls getMax<int>(int, int)
  std::cout << getMax<>(5, 10) << std::endl; // calls getMax<int>(int, int), not template functions are not considered
  std::cout << getMax(5, 10) << std::endl; // will call getMax(char, char)
  return 0;
}
#+end_src

#+RESULTS:
| 10 |
| 10 |
| 10 |
** Non-type Template Parameters
- A template parameter used to represent a ~constexpr~ value.
- The following types are accepted as template parameters-
  1. Integral types
  2. Enumeration type
  3. Floating Point type (since C++20)
  4. Literal class types (since C++20)
  5. Etc...
- From C++17 onwards, you can use the ~auto~ keyword to automatically let the compiler deduce the non-type template parameter from the template argument.
#+begin_src C++
#include <iostream>
template <int N>
void print() {
  std::cout << N << std::endl;
}

int main() {
  print<5>();
  return 0;
}
#+end_src

#+RESULTS:
: 5
** Pass Values by Reference To Functions
- Reduces the overhead of copying large objects.
#+begin_src C++
#include <iostream>

void hello(std::string& name) {
  std::cout << name << std::endl;
}

int main() {
  std::string text {"Hello World"};
  hello(text);
  return 0;
}
#+end_src

#+RESULTS:
: Hello World

#+begin_quote
As a rule of thumb, pass fundamental types by value and class (or struct) types by references.
Other common types to pass by value: enumerated types and std::string_view.
Other common types to pass by (const) reference: std::string, std::array, and std::vector.
#+end_quote
- For objects that are cheap to copy, the cost of copying is similar to the cost of binding, so we favor pass by value so the code generated will be faster.
- For objects that are expensive to copy, the cost of the copy dominates, so we favor pass by (const) reference to avoid making a copy.
- ~std::string_view~ is better than ~std::string&~ because when passing different types of strings (c-style string literals, string_view, string), the ~std::string_view~ will be able to reference all those types easily, while passing types other than ~std::string~ to a ~std::string&~ will require the compiler to make a temporary ~std::string~ object (by implicit conversion or copy).
** Return by Reference
- When returning values from a function, a copy is returned.
- This may be expensive for class types.
#+begin_src C++
#include <iostream>
// notice the ampersand (&) in the return type
const int& foo() {
  static constexpr int age {20}; // destroyed at the end of the program
  return age;
}
int main() {
  std::cout << foo() << std::endl;
  return 0;
}
#+end_src

#+RESULTS:
: 20
#+begin_quote
Avoid returning non-const static values as references.
#+end_quote
- Initializing a reference returned by a function to a non reference variable will make a copy of the return value which defeats the entire purpose of returning a reference.
#+begin_src C++
const int& foo() {
  static const int age {20};
  return age;
}

int main() {
  const int age {foo()}; // BAD: Defeats the purpose of returning reference from foo()
  const int& age2 {foo()}; // GOOD
  return 0;
}
#+end_src
** Passing Values to Functions By Address
#+begin_src C++
#include <iostream>
void foo(int* num) {
  std::cout << *num << std::endl;
}

int main() {
  int age {5};
  foo(&age);
  return 0;
}
#+end_src

#+RESULTS:
: 5

#+begin_quote
Prefer using references instead of pointers wherever possible.
#+end_quote
- Passing by address copies the address from the caller to the function.
*** Unscoped Enumerations
- They are defined using the ~enum~ keyword.
#+begin_src C++
enum Color {
  red = 5, // assigned 5
  green, // assigned 6
  blue, // assigned 7
};

int main() {
  // Now, we can use Color as a data type
  Color apple {red};
  Color shirt {blue};

  Color ball {2}; // ERROR because 2 is not a part of the enum Color
  return 0;
}
#+end_src

#+RESULTS:
- Enumerators are implicitly ~constexpr~.
- Enums are commonly used to store days of week, months, suits in a deck of card, directions (north, east, west, south), log levels (warning, errors, etc), status codes, and a lot more things.
- Enumerations are small and inexpensive to copy, so it's *fine* to pass them by value.
- Unscoped enumerations put their enumerator names into the same scope as they are defined in (global scope, in the above example). This can cause clutter and naming collisions.
- Unscoped enumerations also provide a named scope region for their enumerators. For example, ~Color::red~ can be used.
- The following should be used to prevent polluting the parent scope-
#+begin_src C++
namespace Color {
  enum Color {
    red, // assigned 0
    green, // assigned 1
    blue, // assigned 2
  }
}

int main() {
  Color::Color apple {Color::red}; // notice the data type and the enumerator
  return 0;
}
#+end_src
**** Designated Initializers
- Only for C++20 and above.
#+begin_src C++ :flags -std=c++14
#include <iostream>
struct Employee {
  int id {};
  int age {};
  double wage {};
};

int main() {

  Employee tenma { .id{1}, .age{24}, .wage{60000.0}}; // ok
  Employee johan { .id{2}, .wage{60000.0}}; // ok, age is value initialized (0)
  Employee anna { .wage{60000.0}, .id{3}}; // error, order does not match
  std::cout << john.wage << std::endl;

  return 0;
}
#+end_src

#+RESULTS:
: 60000

#+begin_quote

Do not use designated initializers to prevent clutter. Use the normal way and if you need to add new data members, add them to the end so order won't mix up.
#+end_quote
**** Default Member Initialization
#+begin_src C++
#include <iostream>
struct Something {
  int first; // bad
  int second {}; // 0 initialized
  int third {5}; // default value 5
};

int main() {
  Something thing {}; // first is value initialized to 0, second has default member 0, third is 5
  std::cout << thing.first << std::endl;

  Something anotherThing; // not initialized (bad)
  std::cout << anotherThing.first << std::endl; // garbage value since it's not value initialized
  return 0;
}
#+end_src

#+RESULTS:
|         0 |
| 779647075 |

#+begin_quote

Always provide a default value to each member of structs.
#+end_quote
**** Nested Structs
#+begin_src C++
#include <iostream>
#include <string>

struct Company {
  struct CEO {
    int id {};
    int age {};
  };
  int numberOfEmployees {};
  CEO companyCEO {};
};

int main() {
  Company myCompany {50000, {0, 20}};
  std::cout << myCompany.companyCEO.age << std::endl;
  return 0;
}
#+end_src

#+RESULTS:
: 20
*** Class Templates on Structs
- Just like function templates are used to generate function definitions, class templates are used to generate class types (structs, classes, etc).
#+begin_src C++
#include <iostream>

template <typename T>
struct Point {
  T x {};
  T y {};
};

int main() {
  Point<int> coords {0,0};
  std::cout << coords.x << std::endl;
  std::cout << coords.y << std::endl;
  return 0;
}
#+end_src

#+RESULTS:
| 0 |
| 0 |

- We can *not* overload structs for different data types. The compiler will see them just like a redefinition of the struct.
- We can make functions for these template classes like this-
#+begin_src C++
#include <iostream>
#include <cmath>

template <typename T>
struct Point {
  T x {};
  T y {};
};

template <typename T>
T getDistanceFromOrigin(Point<T> pt) {
  return (std::sqrt(std::pow(pt.x, 2) + std::pow(pt.y, 2)));
}

int main() {
  Point<int> a {2, 10};

  // template argument will be deduced automatically
  std::cout << getDistanceFromOrigin(a) << std::endl;
  return 0;
}
#+end_src

#+RESULTS:
: 10
**** ~std::pair~
- Working with pairs of data is very common.
- The C++ standard library has a built-in class template for a pair type with ~first~ and ~second~ as the data members.
#+begin_src C++
#include <iostream>
#include <utility>

int main() {
  std::pair<int, double> a{2, 3.4};
  std::cout << a.first << std::endl;
  std::cout << a.second << std::endl;
  return 0;
}
#+end_src

#+RESULTS:
|   2 |
| 3.4 |
- Favour using this instead of writing your own "pair" class template.
*** Member Functions
- Functions defined inside class types are called member functions.
#+begin_src C++
#include <iostream>
struct Date {
  int day {};
  int month {};
  int year {};

  void print() {
    std::cout << day << '/' << month << '/' << year << std::endl;
  }
};

int main() {
  Date today{23,3,2024};
  today.print();
  return 0;
}
#+end_src

#+RESULTS:
: 23/2/2024
- Member functions can be written in any order in a class type.
- Member functions can also be overloaded as long as they can be differentiated.
- Defining members functions inside structs should be avoided because it makes them a non-agregate, and that's why we use classes instead.
**** Private
Private members of a class type can only be accessed by other members of the same class.
#+begin_quote

It is a good practice to prefix private data members with an ~m_~ like ~m_age~.
#+end_quote
We can set the access level using ~private:~
#+begin_src C++
#include <iostream>
class Date {
public:
  void print() const {
    std::cout << m_year << "-" << m_month << "-" << m_day << std::endl;
  }
private:
  int m_year {2004};
  int m_month {6};
  int m_day {5};
};



int main() {
  Date date {};
  date.print();
  return 0;
}
#+end_src

#+RESULTS:
: 2004-6-5
#+begin_quote

Best Practice: Classes should generally make member variables private and member functions public.
Structs should avoid using access specifiers and all members should be made public.
#+end_quote
- Private members can be accessed by other OBJECTS of the same class too!

**** Naming Constructors
- Constructors have special rules which must be followed while naming them.
  1. The function must have the same name as that of the class type (with the same case).
  2. The function must /not/ return anything.
#+begin_src C++
#include <iostream>
#include <string>
#include <string_view>

class Student {
private:
  std::string m_name {};
  int m_age {};

public:
  // this is the constructor function without any return type
  Student (std::string_view name, int age) {
    m_name = name;
    m_age = age;
  }

  const std::string& getName() const {return m_name;}
  void setName(std::string_view name) {m_name = name;}

  int getAge() {return m_age;}
  void setAge(int age) {m_age = age;}
};

int main() {
  Student s1{"Prayag Jain", 20};
  std::cout << s1.getName() << std::endl;
  return 0;
}
#+end_src

#+RESULTS:
: Prayag Jain

**** Member Initialization List
- No need to assign member variables to the arguments passed to the constructor.
#+begin_src C++
#include <iostream>
#include <string>

class Student {
private:
  std::string m_name{};
  int m_age{};
public:
  Student(std::string_view name, int age): m_name {name}, m_age {age} {
    std::cout << "Initialized successfully" << std::endl;
  }

  const std::string& getName() const {return m_name;}
  void setName(std::string_view name) {m_name = name;}

  int getAge() {return m_age;}
  void setAge(int age) {m_age = age;}
};

int main() {
  Student s1{"Prayag Jain", 20};
  std::cout << s1.getName() << std::endl;
  return 0;
}
#+end_src

#+RESULTS:
| Initialized | successfully |
| Prayag      | Jain         |

